{
    "prayerSteps": [
        {
            "stepId": "niat",
            "title": "Niat Sholat",
            "type": "dynamic",
            "arabicText": "",
            "latinText": "",
            "translation": "",
            "imagePath": "assets/images/sholat/sholat_01_niat.png"
        },
        {
            "stepId": "takbir",
            "title": "Takbiratul Ihram",
            "arabicText": "اللّٰهُ أَكْبَرُ",
            "latinText": "Allahu Akbar",
            "translation": "Allah Maha Besar",
            "imagePath": "assets/images/sholat/sholat_02_takbir.png",
            "audioPath": "audio/prayer/takbir.wav"
        },
        {
            "stepId": "iftitah",
            "title": "Doa Iftitah",
            "arabicText": "اَللّٰهُ أَكْبَرُ كَبِيْرًا وَّالْحَمْدُ لِلّٰهِ كَثِيْرًا وَّسُبْحَانَ اللّٰهِ بُكْرَةً وَّأَصِيْلًا، إِنِّيْ وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمٰوَاتِ وَالْأَرْضَ حَنِيْفًا مُّسْلِمًا وَّمَا أَنَا مِنَ الْمُشْرِكِيْنَ، إِنَّ صَلَاتِيْ وَنُسُكِيْ وَمَحْيَايَ وَمَمَاتِيْ لِلّٰهِ رَبِّ الْعَالَمِيْنَ، لَا شَرِيْكَ لَهُ وَبِذٰلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِيْنَ",
            "latinText": "Allâhu akbar kabîran walḫamdu lillâhi katsîran wa subḫânallâhi bukratan wa ashîlâ. Innî wajjahtu wajhiya lilladzî fatharas samâwâti wal ardla ḫanîfan musliman wa mâ ana minal musyrikîn. Inna shalâtî wa nusukî wa maḫyâya wa mamâtî lillâhi rabbil 'âlamîn. Lâ syarîka lahû wa bi dzâlika umirtu wa ana minal muslimîn.",
            "translation": "Allah Maha Besar, Maha Sempurna kebesaran-Nya. Segala puji bagi Allah, pujian yang sebanyak-banyaknya. Maha Suci Allah sepanjang pagi dan petang. Kuhadapkan wajahku kepada Dzat yang telah menciptakan langit dan bumi dengan penuh ketulusan dan kepasrahan dan aku bukanlah termasuk orang-orang yang musyrik. Sesungguhnya shalatku, ibadahku, hidupku, dan matiku semuanya untuk Allah, penguasa alam semesta. Tidak ada sekutu bagi-Nya dan dengan demikian aku diperintahkan dan aku termasuk orang-orang Islam.",
            "imagePath": "assets/images/sholat/sholat_03_iftitah.png",
            "audioPath": "audio/prayer/iftitah.wav"
        },
        {
            "stepId": "fatihah",
            "title": "Al-Fatihah",
            "arabicText": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝١اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَۙ ۝٢الرَّحْمٰنِ الرَّحِيْمِۙ ۝٣مٰلِكِ يَوْمِ الدِّيْنِۗ ۝٤اِيَّاكَ نَعْبُدُ وَاِيَّاكَ نَسْتَعِيْنُۗ ۝٥اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَۙ ۝٦صِرَاطَ الَّذِيْنَ اَنْعَمْتَ عَلَيْهِمْ ەۙ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّاۤلِّيْنَࣖ ۝٧",
            "latinText": "bismillâhir-raḫmânir-raḫîm\n\n al-ḫamdu lillâhi rabbil-‘âlamîn\n\n ar-raḫmânir-raḫîm\n\n mâliki yaumid-dîn\n\n iyyâka na‘budu wa iyyâka nasta‘în\n\n ihdinash-shirâthal-mustaqîm\n\n shirâthalladzîna an‘amta ‘alaihim ghairil-maghdlûbi ‘alaihim wa ladl-dlâllîn",
            "translation": "Dengan nama Allah Yang Maha Pengasih lagi Maha Penyayang.\n\n Segala puji bagi Allah, Tuhan semesta alam.\n\n Yang Maha Pengasih lagi Maha Penyayang,\n\n Pemilik hari Pembalasan.\n\n Hanya kepada Engkaulah kami menyembah dan hanya kepada Engkaulah kami memohon pertolongan.\n\n Bimbinglah kami ke jalan yang lurus,\n\n (Yaitu) jalan orang-orang yang telah Engkau beri nikmat kepadanya; bukan (jalan) mereka yang dimurkai, dan bukan (pula jalan) mereka yang sesat.",
            "imagePath": "assets/images/sholat/sholat_04_berdiri.png",
            "audioPath": "audio/prayer/fatihah.mp3"
        },
        {
            "stepId": "surat",
            "title": "Surat Pendek",
            "arabicText": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ. قُلْ هُوَ اللّٰهُ اَحَدٌۚ. اَللّٰهُ الصَّمَدُۚ. لَمْ يَلِدْ وَلَمْ يُوْلَدْۙ. وَلَمْ يَكُنْ لَّهُ كُفُوًا اَحَدٌ.",
            "latinText": "Bismillâhir-raḫmânir-raḫîm. Qul huwallâhu aḫad. Allâhus-samad. Lam yalid wa lam yûlad. Wa lam yakul lahû kufuwan aḫad.",
            "translation": "Katakanlah (Muhammad), 'Dialah Allah, Yang Maha Esa. Allah tempat meminta segala sesuatu. (Allah) tidak beranak dan tidak pula diperanakkan. Dan tidak ada sesuatu yang setara dengan-Nya.'",
            "imagePath": "assets/images/sholat/sholat_04_berdiri.png"
        },
        {
            "stepId": "ruku",
            "title": "Ruku",
            "arabicText": "سُبْحَانَ رَبِّيَ الْعَظِيْمِ وَبِحَمْدِهِ ×٣",
            "latinText": "Subḫâna rabbiyal ‘adhîmi wa bi ḫamdih (3x)",
            "translation": "Maha Suci Tuhanku Yang Maha Agung serta memujilah aku kepada-Nya. (3x)",
            "imagePath": "assets/images/sholat/sholat_05_ruku.png",
            "audioPath": "audio/prayer/ruku.wav"
        },
        {
            "stepId": "itidal",
            "title": "I'tidal",
            "arabicText": "رَبَّنَا لَكَ الْحَمْدُ مِلْءُ السَّمَاوَاتِ وَمِلْءُ الْأَرْضِ وَمِلْءُ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ",
            "latinText": "Rabbanâ lakal ḫamdu mil’us samâwati wa mil‘ul ardli wa mil‘u mâ syi’ta min syai’in ba’du",
            "translation": "Ya Allah Tuhan kami, bagi-Mu segala puji, sepenuh langit dan bumi dan sepenuh apa saja yang Engkau kehendaki sesudah itu.",
            "imagePath": "assets/images/sholat/sholat_06_itidal.png",
            "audioPath": "audio/prayer/itidal.wav"
        },
        {
            "stepId": "sujud",
            "title": "Sujud",
            "arabicText": "سُبْحَانَ رَبِّيَ الْأَعْلَى وَبِحَمْدِهِ ×٣",
            "latinText": "Subhana rabbiyal a'la wa bihamdih (3x)",
            "translation": "Maha Suci Tuhanku Yang Maha Tinggi dan dengan segala puji-Nya (3x)",
            "imagePath": "assets/images/sholat/sholat_07_sujud.png",
            "audioPath": "audio/prayer/sujud.wav"
        },
        {
            "stepId": "duduk_sujud",
            "title": "Duduk di Antara Dua Sujud",
            "arabicText": "رَبِّ اغْفِرْ لِيْ وَارْحَمْنِيْ وَاجْبُرْنِيْ وَارْفَعْنِيْ وَارْزُقْنِيْ وَاهْدِنِيْ وَعَافِنِيْ وَاعْفُ عَنِّيْ",
            "latinText": "Rabbighfirlî warḫamnî wajburnî warfa‘nî warzuqnî wahdinî wa ‘âfinî wa‘fu ‘annî",
            "translation": "Ya Allah, ampunilah dosaku, belas kasihanilah aku, perbaikilah kesalahanku, angkatlah derajatku, berilah aku rezeki, anugerahilah aku petunjuk, karuniailah aku kesehatan, dan maafkanlah aku.",
            "imagePath": "assets/images/sholat/sholat_08_duduk.png",
            "audioPath": "audio/prayer/duduk_sujud.wav"
        },
        {
            "stepId": "tasyahud_awal",
            "title": "Tahiyat Awal",
            "arabicText": "التَّحِيَّاتُ الْمُبَارَكَاتُ الصَّلَوَاتُ الطَّيِّبَاتُ لِلّٰهِ، السَّلامُ عَلَيْكَ أيُّهَا النَّبِيُّ وَرَحْمَةُ اللّٰهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللّٰهِ الصَّالِحِيْنَ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا اللّٰهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا رَّسُوْلُ اللّٰهِ",
            "latinText": "Attahiyyâtul mubârakâtush shalâwatuth thayyibâtu lillâh. Assalâmu ‘alaika ayyuhan nabiyyu wa raḫmatullâhi wa barakâtuh. Assalâmu ‘alainâ wa‘alâ ‘ibadillâhish shâliḫîn. Asyhadu an lâilâha illallâh wa asyhadu anna muḫammadar rasûlullâh",
            "translation": "Segala kehormatan, keberkahan, rahmat, dan kebaikan adalah milik Allah. Semoga keselamatan, rahmat Allah dan berkah-Nya (tetap tercurahkan) atasmu, wahai Nabi (Muhammad). Semoga keselamatan (tetap terlimpahkan) atas kami dan atas hamba-hamba Allah yang saleh. Aku bersaksi bahwa tidak ada Tuhan selain Allah dan aku bersaksi bahwa Muhammad adalah utusan Allah.",
            "imagePath": "assets/images/sholat/sholat_09_tasyahud_awal.png",
            "audioPath": "audio/prayer/tasyahut_awal.wav"
        },
        {
            "stepId": "tasyahud_akhir",
            "title": "Tahiyat Akhir",
            "arabicText": "التَّحِيَّاتُ الْمُبَارَكَاتُ الصَّلَوَاتُ الطَّيِّبَاتُ لِلّٰهِ، السَّلَامُ عَلَيْكَ أيُّهَا النَّبِيُّ وَرَحْمَةُ اللّٰهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللّٰهِ الصَّالِحِيْنَ، أشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا اللّٰهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا رَّسُولُ اللّٰهِ\n\n اَللّٰهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَّعَلَى اٰلِ سَيِّدِنَا مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى سَيِّدِنَا إِبْرَاهِيْمَ وَعَلَى اٰلِ سَيِّدِنَا إِبْرَاهِيْمَ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ وَّعَلَى اٰلِ سَيِّدِنَا مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى سَيّدِنَا إِبْرَاهِيْمَ وَعَلَى اٰلِ سَيِّدِنَا إِبْرَاهِيْمَ فِي الْعَالَمِيْنَ إنَّكَ حَمِيْدٌ مَّجِيْدٌ",
            "latinText": "Attahiyyâtul mubârakâtush shalawatuth thayyibâtu lillâh. Assalâmu ‘alaika ayyuhan nabiyyu waraḫmatullâhi wabarakâtuh. Assalâmu ‘alainâ wa ‘alâ ‘ibadadillâhish shâliḫîn. Asyhadu an lâilâha illallâh wa asyhadu anna muḫammadar rasûlullâh\n\n Allâhumma shalli ‘alâ sayyidinâ muḫammad wa ‘alâ âli sayyidinâ muḫammad kamâ shallaitâ ‘alâ sayyidinâ ibrâhîm wa ‘alâ âli sayyidinâ ibrâhîm wa bârik ‘alâ sayyidinâ muḫammad wa ‘alâ âli sayyidinâ muḫammad kamâ bârakta ‘alâ sayyidinâ ibrâhîm wa ‘alâ âli sayyidinâ ibrâhîm. Fil ‘âlamîna innaka ḫamîdum majîd",
            "translation": "Segala kehormatan, keberkahan, rahmat dan kebaikan adalah milik Allah. Semoga keselamatan, rahmat Allah dan berkah-Nya (tetap tercurahkan) atas mu, wahai Nabi (Muhammad). Semoga keselamatan (tetap terlimpahkan) atas kami dan atas hamba-hamba Allah yang saleh. Aku bersaksi bahwa tidak ada Tuhan selain Allah dan aku bersaksi bahwa Muhammad adalah utusan Allah.\n\n Ya Allah, limpahkanlah rahmat kepada junjungan kami Nabi Muhammad dan kepada keluarga junjungan kami Nabi Muhammad, sebagaimana pernah Engkau beri rahmat kepada junjungan kami Nabi Ibrahim dan kepada keluarga junjungan kami Nabi Ibrahim. Dan limpahilah berkah kepada kepada junjungan kami Nabi Muhammad dan kepada keluarga junjungan kami Nabi Muhammad, sebagaimana Engkau pernah beri berkah kepada junjungan kami Nabi Ibrahim dan kepada keluarga junjungan kami Nabi Ibrahim. Di seluruh alam semesta Engkaulah Yang Terpuji dan Maha Mulia.",
            "imagePath": "assets/images/sholat/sholat_10_tasyahud_akhir.png",
            "audioPath": "audio/prayer/tasyahut_akhir.mp3"
        },
        {
            "stepId": "salam",
            "title": "Salam",
            "arabicText": "السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللهِ",
            "latinText": "Assalamu'alaikum wa rahmatullah",
            "translation": "Semoga kesejahteraan dan rahmat Allah tercurah kepada kalian",
            "imagePath": "assets/images/sholat/sholat_11_salam.png",
            "audioPath": "audio/prayer/salam.mp3"
        },
        {
            "stepId": "qunut",
            "title": "Doa Qunut",
            "arabicText": "اَللّٰهُمَّ اهْدِنِيْ فِيْمَنْ هَدَيْتَ، وَعَافِنِيْ فِيْمَنْ عَافَيْتَ، وَتَوَلَّنِيْ فِيْمَنْ تَوَلَّيْتَ، وَبَارِكْ لِيْ فِيْمَا أَعْطَيْتَ، وَقِنِيْ شَرَّمَا قَضَيْتَ، فَإِ نَّكَ تَقْضِيْ وَلَا يُقْضَى عَلَيْكَ وَإِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ، وَلَا يَعِزُّ مَنْ عَادَيْتَ، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ، فَلَكَ الْحَمْدُ عَلَى مَا قَضَيْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ، وَصَلَّى اللهُ عَلَى سَيِّدِنَا مُحَمَّدٍ ࣙالنَّبِيِّ الْأُمِّيِّ وَعَلَى اٰلِهِ وَصَحْبِهِ وَبَارَكَ وَسَلَّمَ",
            "latinText": "Allahummahdinî fî man hadait, wa ‘âfinî fî man ‘âfait, wa tawallanî fî man tawallait, wa bâriklî fî mâ a‘thait, wa qinî syarra mâ qadhait, fa innaka taqdhî wa lâ yuqdhâ ‘alaik, wa innahû lâ yazillu man wâlait, wa lâ ya‘izzu man ‘âdait, tabârakta rabbanâ wa ta‘âlait, fa lakal ḫamdu a’lâ mâ qadhait, astaghfiruka wa atûbu ilaik, wa shallallâhu ‘alâ sayyidinâ muḫammadi-nin-nabiyyil ummiyyi wa ‘alâ âlihî wa shaḫbihî wa bâraka wa sallam.",
            "translation": "Ya Allah tunjukanlah aku sebagaimana mereka yang telah Engkau beri petunjuk. Berilah kesehatan kepadaku sebagaimana mereka yang telah Engkau berikan kesehatan. Peliharalah aku sebagaimana orang-orang yang telah Engkau lindungi. Berikanlah keberkahan kepadaku pada apa yang telah Engkau berikan. Selamatkanlah aku dari bahaya kejahatan yang telah Engkau tentukan. Engkaulah yang menghukum dan bukan dihukum. Tidak hina orang yang Engkau jadikan pemimpin. Tidak mulia orang yang Engkau musuhi. Maha Suci Engkau wahai Tuhan kami dan Maha Tinggi Engkau. Bagi-Mu segala pujian di atas apa yang Engkau tentukan. Aku memohon ampun kepada-Mu dan bertaubat kepada-Mu. Semoga Allah mencurahkan rahmat, keselamatan, dan berkah atas junjungan kami Nabi Muhammad SAW, keluarga, dan para sahabatnya.",
            "imagePath": "assets/images/sholat/sholat_12_qunut.png"
        },
        {
            "stepId": "takbir_jenazah_1",
            "title": "Takbir Pertama (Al-Fatihah)",
            "arabicText": "اللّٰهُ أَكْبَرُ",
            "latinText": "Allahu Akbar",
            "translation": "Allah Maha Besar. Dilanjutkan membaca Al-Fatihah.",
            "imagePath": "assets/images/sholat/sholat_13_jenazah.png"
        },
        {
            "stepId": "takbir_jenazah_2",
            "title": "Takbir Kedua (Sholawat)",
            "arabicText": "اَللّٰهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى اٰلِ سَيِّدِنَا مُحَمَّدٍ",
            "latinText": "Allâhumma shalli ‘alâ sayyidinâ muḫammadin wa ‘alâ âli sayyidinâ muḫammad",
            "translation": "Ya Allah, limpahkanlah rahmat kepada junjungan kami Nabi Muhammad dan kepada keluarga junjungan kami Nabi Muhammad.",
            "imagePath": "assets/images/sholat/sholat_13_jenazah.png"
        },
        {
            "stepId": "takbir_jenazah_3",
            "title": "Takbir Ketiga (Doa Jenazah)",
            "arabicText": "اَللّٰهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ",
            "latinText": "Allâhummaghfirlahu warḫamhu wa ‘âfihi wa‘fu ‘anhu",
            "translation": "Ya Allah, ampunilah dia, rahmatilah dia, sejahterakanlah dia, dan maafkanlah kesalahannya.",
            "imagePath": "assets/images/sholat/sholat_13_jenazah.png"
        },
        {
            "stepId": "takbir_jenazah_4",
            "title": "Takbir Keempat (Doa Penutup)",
            "arabicText": "اَللّٰهُمَّ لَا تَحْرِمْنَا أَجْرَهُ وَلَا تَفْتِنَّا بَعْدَهُ وَاغْفِرْ لَنَا وَلَهُ",
            "latinText": "Allâhumma lâ taḫrimnâ ajrahu wa lâ taftinnâ ba‘dahu waghfirlanâ wa lahu",
            "translation": "Ya Allah, janganlah kiranya Engkau menghalangi kami memperoleh pahalanya, dan janganlah Engkau fitnah kami sesudahnya, serta ampunilah kami dan dia.",
            "imagePath": "assets/images/sholat/sholat_13_jenazah.png"
        },
        {
            "stepId": "takbir_extra",
            "title": "Takbir Tambahan",
            "arabicText": "اللّٰهُ أَكْبَرُ",
            "latinText": "Allahu Akbar",
            "translation": "Allah Maha Besar",
            "imagePath": "assets/images/sholat/sholat_02_takbir.png"
        },
        {
            "stepId": "tasbih",
            "title": "Bacaan Tasbih",
            "arabicText": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ",
            "latinText": "Subhanallah walhamdulillah wala ilaha illallah wallahu akbar",
            "translation": "Maha Suci Allah, segala puji bagi Allah, tiada Tuhan selain Allah, Allah Maha Besar",
            "imagePath": "assets/images/sholat/sholat_04_berdiri.png"
        }
    ]
}